Revit 2027 API
ParameterTypeId.PointElementHostedParam Property
 "Hosted Parameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointElementHostedParam { get; }
Public Shared ReadOnly Property PointElementHostedParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointElementHostedParam {
	ForgeTypeId^ get ();
}
static member PointElementHostedParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace